concurrency/load testing scripts/config_test33java.yaml
version: 1
config:
  target: "http://localhost:6868"
  phases:
    - duration: 30
      arrivalRate: 50
      maxVusers: 50
  defaults:
        headers:
            authorization: token 5188dce15dba9cfa95199872cbf4d6995ef15b67
scenarios:
  - flow:
      - put:
          url: "/api/tutorials2/11"
          json:
            title: "test1"
            description: "first"